IDENTIFICATION DIVISION.
PROGRAM-ID. COMPTEST.

DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 WS-TEST-VALUE-1 PIC 9V9(1) VALUE 1.3.
	01 WS-TEST-VALUE-2 PIC 9V9(1) COMP-3 VALUE 1.3.

PROCEDURE DIVISION.
	IF (WS-TEST-VALUE-1 = 1) THEN
		DISPLAY "Test value 1 is 1"
	END-IF.

	IF (WS-TEST-VALUE-2 = 1) THEN
		DISPLAY "Test value 2 (comp-3) is 1"
	END-IF.

STOP RUN.
